{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attr": {
        "__predict__": "True", 
        "shape": "[0, 0, 3, 16]"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "NHCW2Conv", 
      "name": "nhcw2conv1", 
      "attr": {
        "__predict__": "True", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quanti_input_input_shift_history", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiInput", 
      "name": "quanti_input", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "conv1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(7, 7)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 1], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "conv2", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(5, 5)", 
        "num_filter": "16", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(6, 6)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(6, 6)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(6, 6)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "fc1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(6, 6)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1], [21, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "fc2", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "fc3", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1], [33, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fc4_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "fc4", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "fc5_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "3", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "3", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "3", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "fc5", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "kernel": "(1, 1)", 
        "num_filter": "3", 
        "stride": "(1, 1)", 
        "use_activation": "False", 
        "vector_quanti": "True"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attr": {
        "__predict__": "True", 
        "shape": "[0, 3]"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "attr": {
        "__predict__": "True", 
        "use_ignore": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "attr": {
        "__predict__": "True", 
        "use_ignore": "True"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    5, 
    6, 
    7, 
    8, 
    9, 
    11, 
    12, 
    13, 
    14, 
    15, 
    17, 
    18, 
    19, 
    20, 
    21, 
    23, 
    24, 
    25, 
    26, 
    27, 
    29, 
    30, 
    31, 
    32, 
    33, 
    35, 
    36, 
    37, 
    38, 
    39, 
    41, 
    42, 
    43, 
    44, 
    45, 
    48
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50
  ], 
  "heads": [[49, 0, 0]], 
  "attrs": {
    "build_version": ["str", " commit 5d92bac119e95094a2eac306cdcfbf085b50440a Author: yushu.gao <yushu.gao@horizon.ai> Date:   Tue Aug 13 11:41:25 2019 +0800"], 
    "mxnet_version": ["int", 10300]
  }
}